app/views/actions/_form.html.erb

SELECT "users".* FROM "users"
---
     <%= f.fields_for :participants do |e|%>
         <% User.all.each do |d|%>