app/controllers/actions_controller.rb

SELECT  "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", 1]]
---
def show

  @action=Action.find_by_id(params[:id])

SELECT "actions".* FROM "actions"
SELECT "users".* FROM "users"
---
 def index
   @actions=Action.all
   @user=User.all

INSERT INTO "actions" ("event_title", "date", "time", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_title", "dasdsad"], ["date", "dsadsad"], ["time", "dsadsad"], ["description", "dsadasd"], ["created_at", "2016-11-15 07:04:08.844746"], ["updated_at", "2016-11-15 07:04:08.844746"]]
INSERT INTO "participants" ("user_id", "action_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["action_id", 16], ["created_at", "2016-11-16 04:26:06.003385"], ["updated_at", "2016-11-16 04:26:06.003385"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
 def create

   @action = Action.new(action_params)
   @action.owner = current_user
   @action.users << User.find(params["participant"])

SELECT  "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", 7]]
---
def edit

  @event_action=Action.find(params[:id])

SELECT  "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "actions" SET "event_title" = $1, "venue" = $2, "description" = $3, "updated_at" = $4 WHERE "actions"."id" = $5  [["event_title", "event"], ["venue", "mysuru"], ["description", "Zczxcxv"], ["updated_at", "2016-11-16 08:43:36.361397"], ["id", 7]]
---
def update
  @action=Action.find_by_id(params[:id])

  @action.update_attributes(action_params)

SELECT  "actions".* FROM "actions" WHERE "actions"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "actions" WHERE "actions"."id" = $1  [["id", 1]]
---
 def destroy
  binding.pry
   @action=Action.find_by_id(params[:id])
   @action.destroy