app/controllers/password_resets_controller.rb

  def update

    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$LxL9FRGJScGV5SitiXhyeuzBy5gF7GvH5cnJ9QKocnXMsH.zTgHYG"], ["updated_at", "2016-11-29 09:23:49.251490"], ["id", 1]]