app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
     @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "password", "password_confirmation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["username", ""], ["password", ""], ["password_confirmation", ""], ["created_at", "2016-11-11 08:42:36.685036"], ["updated_at", "2016-11-11 08:42:36.685036"]]